Revit 2021.1 API
Document Properties
The Document type exposes the following members.
Properties
Name | Description
ActiveProjectLocation
Retrieve the active project location.
ActiveView
The document's active view.
Application
Returns the Application in which the Document resides.
Create
An object that can be used to create new instances of Autodesk Revit API elements within a project.
DisplayUnitSystem
Provides access to display unit type with in the document.
FamilyCreate
An object that can be used to create new instances of Autodesk Revit API elements within a family document.
FamilyManager
The family manager object provides access to family types and parameters.
IsDetached
 Identifies if a workshared document is detached. Also, see IsWorkshared
IsFamilyDocument
Identifies if the current document is a family document.
IsLinked
 Identifies if a document is a linked RVT.
IsModelInCloud
 Identifies if document is stored on Autodesk cloud services.
IsModifiable
 The document's state of modifiability.
IsModified
 The state of changes made to the document.
IsReadOnly
 Identifies if the document is read-only or can possibly be modified.
IsReadOnlyFile
 Signals whether the document was opened from a read-only file.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsWorkshared
 Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see IsDetached
MassDisplayTemporaryOverride
 This setting controls temporary display in views of objects with mass category or subcategories.
MullionTypes
This property is used to retrieve all the mullion types in current system.
OwnerFamily
Get the Family of this Family Document.
PanelTypes
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
ParameterBindings
Retrieves an object from which mappings between parameter definitions and categories can be found.
PathName
 The fully qualified path of the document's disk file.
Phases
Retrieves all the object that represent phases within the project.
PlanTopologies
Get the PlanTopologies of the current project in the last phase.
PlanTopologies[Phase]
Gets the PlanTopologies of the current project in a given phase.
PlanTopology[Level]
Get the PlanTopology of a given level in the last phase.
PlanTopology[Level, Phase]
Get the PlanTopology of a given level in a given phase.
PrintManager
 Retrieve the PrintManager of current project.
ProjectInformation
Return the Project Information of the current project.
ProjectLocations
Retrieve all the project locations associated with this project
ReactionsAreUpToDate
Reports if the analytical model has regenerated in a document with reaction loads.
Settings
Provides access to general application settings, such as Categories.
SiteLocation
Returns the site location information.
Title
 The document's title.
TypeOfStorage
Get the storage type of the specified BuiltInParameter.
WorksharingCentralGUID
 The central GUID of the server-based model.
See Also
Document Class
Autodesk.Revit.DB Namespace